head_first_rails/climbers/app/controllers/incidents_controller.rb

SELECT * FROM "incidents" WHERE ("incidents"."id" = 1)
---
  def show_with_map
    @incident = Incident.find(params[:id])

SELECT * FROM "incidents"
---
  def index
    @incidents = Incident.all

SELECT * FROM "incidents" WHERE ("incidents"."id" = 1)
---
  def show
    @incident = Incident.find(params[:id])

SELECT * FROM "incidents" WHERE ("incidents"."id" = 2)
---
  def edit
    @incident = Incident.find(params[:id])

INSERT INTO "incidents" ("latitude", "updated_at", "title", "mountain", "description", "longitude", "when", "created_at") VALUES(37.456, '2009-08-22 21:06:16', 'My first climb', 'Everest', 'blah blah blah', -82.0, '2009-08-22 21:05:00', '2009-08-22 21:06:16')
---
  def create
    @incident = Incident.new(params[:incident])

    respond_to do |format|
      if @incident.save

SELECT * FROM "incidents" WHERE ("incidents"."id" = 2)
UPDATE "incidents" SET "latitude" = 25.0, "longitude" = -90.0, "updated_at" = '2009-08-24 16:07:14' WHERE "id" = 2
---
  def update
    @incident = Incident.find(params[:id])

    respond_to do |format|
      if @incident.update_attributes(params[:incident])