head_first_rails/coconut/app/controllers/seats_controller.rb

  def flight_seats
    @flight = Flight.find(params[:flight_id])
---
SELECT * FROM "flights" WHERE ("flights"."id" = 1)

  def index
    @seats = Seat.all
---
SELECT * FROM "seats"

  def show
    @seat = Seat.find(params[:id])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 1)

  def create
    @seat = Seat.new(params[:seat])

    respond_to do |format|
      if @seat.save
---
INSERT INTO "seats" ("name", "updated_at", "flight_id", "baggage", "created_at") VALUES('Nathan Koch', '2009-08-22 18:57:00', 1, 0.5, '2009-08-22 18:57:00')

  def destroy
    @seat = Seat.find(params[:id])
    @seat.destroy
---
SELECT * FROM "seats" WHERE ("seats"."id" = 11)
DELETE FROM "seats" WHERE "id" = 11