head_first_rails/training/app/controllers/client_workouts_controller.rb

SELECT * FROM "client_workouts" WHERE (client_name = 'Nathan' OR trainer = 'Nathan')
---
  def find
    @client_workouts = ClientWorkout.find(:all,
    :conditions=>["client_name = ? OR trainer = ?",
      params[:search_string], params[:search_string]])

SELECT * FROM "client_workouts"
---
  def index
    @client_workouts = ClientWorkout.all

SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 1)
---
  def show
    @client_workout = ClientWorkout.find(params[:id])

SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 2)
---
  def edit
    @client_workout = ClientWorkout.find(params[:id])

INSERT INTO "client_workouts" ("updated_at", "client_name", "trainer", "paid_amount", "duration_mins", "date_of_workout", "created_at") VALUES('2009-08-21 19:44:42', 'Nathan', 'Jim', 1000.0, 100, '2009-08-21', '2009-08-21 19:44:42')
---
  def create
    @client_workout = ClientWorkout.new(params[:client_workout])

    respond_to do |format|
      if @client_workout.save

SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 2)
UPDATE "client_workouts" SET "paid_amount" = 10.0, "updated_at" = '2009-08-22 17:21:51' WHERE "id" = 2
---
  def update
    @client_workout = ClientWorkout.find(params[:id])

    respond_to do |format|
      if @client_workout.update_attributes(params[:client_workout])